<?php
define('LARAVEL_START', microtime(true));
/*
|--------------------------------------------------------------------------
| Register The Composer Auto Loader
|--------------------------------------------------------------------------
| Composer предоставляет удобный, автоматически сгенерированный загрузчик
| классов для нашего приложения. Это показано в скрипте, чтобы нам не
| приходилось вручную загружать какие-либо классы PHP приложения.
|
*/
require __DIR__.'/../vendor/autoload.php';