<?php
return [
    /*
    |--------------------------------------------------------------------------
    | Default Cache Store
    |--------------------------------------------------------------------------
    | Эта опция контролирует соединение с кешем по умолчанию, которое используется
    | в библиотеке кэширования. Это соединение используется, когда другое
    | не указано при выполнении данной функции кэширования.
    |
    | Поддерживается: "apc", "array", "database", "file", "memcached", "redis"
    |
    */
    'default' => env('CACHE_DRIVER', 'file'),
    /*
    |--------------------------------------------------------------------------
    | Cache Stores
    |--------------------------------------------------------------------------
    |Здесь вы можете определить все «хранилища» кеша для вашего приложения как
    |как и их драйвера. Вы можете даже определить несколько хранилищ для
    |тот же драйвер кеша для группировки типов элементов, хранящихся в ваших кешах.
    */
    'stores' => [
        'apc' => [
            'driver' => 'apc',
        ],
        'array' => [
            'driver' => 'array',
        ],
        'database' => [
            'driver' => 'database',
            'table' => 'cache',
            'connection' => null,
        ],
        'file' => [
            'driver' => 'file',
            'path' => storage_path('framework/cache/data'),
        ],
        'memcached' => [
            'driver' => 'memcached',
            'persistent_id' => env('MEMCACHED_PERSISTENT_ID'),
            'sasl' => [
                env('MEMCACHED_USERNAME'),
                env('MEMCACHED_PASSWORD'),
            ],
            'options' => [
                // Memcached::OPT_CONNECT_TIMEOUT  => 2000,
            ],
            'servers' => [
                [
                    'host' => env('MEMCACHED_HOST', '127.0.0.1'),
                    'port' => env('MEMCACHED_PORT', 11211),
                    'weight' => 100,
                ],
            ],
        ],
        'redis' => [
            'driver' => 'redis',
            'connection' => 'default',
        ],
    ],
    /*
    |--------------------------------------------------------------------------
    | Cache Key Prefix
    |--------------------------------------------------------------------------
    | При использовании хранилища на основе ОЗУ, такого как APC или Memcached, возможно
    | использовать и другие приложения, использующие тот же кеш. Указано
    | значение, чтобы получить префикс для всех ключей.
    */
    'prefix' => 'laravel',
];